app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @comments = Comment.find_all_by_post_id(@post.id)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."post_id" = 2) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "author", "updated_at", "message_html", "message") VALUES('2010-08-10 06:24:07', 'Hey', 'hey', '2010-08-10 06:24:07', '<p>&lt;p&gt;&lt;a name=&quot; 	 <iframe class="youtube-player" type="text/html" width="400" height="250" src="http://www.youtube.com/embed/Y5lO4hEAJHU" frameborder="0">

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2010-08-08 22:31:07', "title" = 'LOl', "message" = 'hahahaha' WHERE "id" = 1