app/controllers/tags_controller.rb

SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def show
     @tag = Tag.find(params[:id])